tests/load/artillery-config.yml
config:
  target: "{{ $processEnvironment.LOADTEST_BASE_URL }}"
  processor: "./processor.cjs"
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warmup
    - duration: 120
      arrivalRate: 10
      rampTo: 100
      name: Ramp
    - duration: 60
      arrivalRate: 500
      name: Spike
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.LOADTEST_JWT_TOKEN }}"
      Content-Type: application/json
  ensure:
    maxErrorRate: 5
    p95: 500

scenarios:
  - name: Heartbeat loop
    weight: 5
    flow:
      - function: randomCoords
      - post:
          url: /sharing/heartbeat
          json:
            latitude: "{{ lat }}"
            longitude: "{{ lng }}"

  - name: Nearby poll
    weight: 3
    flow:
      - function: randomCoords
      - get:
          url: /sharing/nearby
          qs:
            latitude: "{{ lat }}"
            longitude: "{{ lng }}"
            radiusMeters: "152.4"
            sort: distance

  - name: Discoverable toggle
    weight: 2
    flow:
      - function: randomCoords
      - function: nextToggle
      - patch:
          url: /profile/discoverable
          beforeRequest: setTogglePayload